public class Aufgabe_1 {
    public static void main(String[] args) {
       /* Напишите программу, которая выводит на экран информацию о вас (или выдуманном персонаже)
        в три строчки:

        "Меня зовут ..."
        "Мне ... лет"
        "Я из ..."
        На месте многоточий должны использоваться переменные!

                */
        String name="Tatjana";
        int age=48;
        String city= "Bielefeld";

        System.out.println("Меня зовут "+name+".");
        System.out.println("Мне "+age+" лет.");
        System.out.println("Я из "+city+".");
        //Меня зовут Tatjana.
        //Мне48 лет.
        //Я из Bielefeld.

    }
}
